In [10]:
import pandas as pd

In [11]:
df1 = pd.DataFrame({'Names':["ahmed","mohamed","malik","khaled","rami","marko"],
                   'Age':[21,19,17,20,30,25]})

df2 = pd.DataFrame({'Names':["yousef","boody","abd allah","zian","hany","ibrahim"],
                   'Age':[22,21,19,19,29,21]})

df3 = pd.DataFrame({'Names':["harry","hermony","ron","malfoy","sevrioous","dampldour"],
                   'Agr':[25,25,26,27,50,150]})


dfs = {'Group1':df1,
      'Group2':df2,
      'Group3':df3}

In [12]:
dfs

{'Group1':      Names  Age
 0    ahmed   21
 1  mohamed   19
 2    malik   17
 3   khaled   20
 4     rami   30
 5    marko   25,
 'Group2':        Names  Age
 0     yousef   22
 1      boody   21
 2  abd allah   19
 3       zian   19
 4       hany   29
 5    ibrahim   21,
 'Group3':        Names  Agr
 0      harry   25
 1    hermony   25
 2        ron   26
 3     malfoy   27
 4  sevrioous   50
 5  dampldour  150}

In [14]:
writer = pd.ExcelWriter('NamesAndAges.xlsx')

for sheet_name in dfs.keys():
    dfs[sheet_name].to_excel(writer, sheet_name=sheet_name, index=False)

writer.save()

C:\Users\ar326\AppData\Local\Temp\ipykernel_38604\3119676409.py:6: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()

In [15]:
df = pd.read_excel("NamesAndAges.xlsx", sheet_name=['Group1','Group2','Group3'])
df

{'Group1':      Names  Age
 0    ahmed   21
 1  mohamed   19
 2    malik   17
 3   khaled   20
 4     rami   30
 5    marko   25,
 'Group2':        Names  Age
 0     yousef   22
 1      boody   21
 2  abd allah   19
 3       zian   19
 4       hany   29
 5    ibrahim   21,
 'Group3':        Names  Agr
 0      harry   25
 1    hermony   25
 2        ron   26
 3     malfoy   27
 4  sevrioous   50
 5  dampldour  150}

In [16]:
df = pd.concat(df[frame] for frame in df.keys())
df

       Names   Age    Agr
0      ahmed  21.0    NaN
1    mohamed  19.0    NaN
2      malik  17.0    NaN
3     khaled  20.0    NaN
4       rami  30.0    NaN
5      marko  25.0    NaN
0     yousef  22.0    NaN
1      boody  21.0    NaN
2  abd allah  19.0    NaN
3       zian  19.0    NaN
4       hany  29.0    NaN
5    ibrahim  21.0    NaN
0      harry   NaN   25.0
1    hermony   NaN   25.0
2        ron   NaN   26.0
3     malfoy   NaN   27.0
4  sevrioous   NaN   50.0
5  dampldour   NaN  150.0